{
  "testimonials": [
    {
      "name": "Emma K.",
      "platform": "tiktok",
      "rating": 5,
      "text": "obsessed with this dress!! the navy blue with gold rhinestones is literally so stunning. wore it to my birthday and got compliments all night 🎉",
      "date": "2 days ago",
      "img": 0
    },
    {
      "name": "Sophia L.",
      "platform": "instagram",
      "rating": 5,
      "text": "the fit is PERFECT. bodycon but not too tight, and the slit is the perfect length. the gold rhinestones catch the light so beautifully ✨",
      "date": "5 days ago",
      "img": 1
    },
    {
      "name": "Mia T.",
      "platform": "tiktok",
      "rating": 5,
      "text": "this navy dress with the gold accents is chef's kiss. true to size and hugs my curves in all the right places. already wore it twice!!",
      "date": "1 week ago",
      "img": 2
    },
    {
      "name": "Isabella G.",
      "platform": "facebook",
      "rating": 5,
      "text": "The quality is incredible. All the rhinestones are secure and the fabric has great stretch. Looks way more expensive than it is!",
      "date": "1 week ago",
      "img": 3
    },
    {
      "name": "Ava M.",
      "platform": "instagram",
      "rating": 5,
      "text": "wore this to my friend's bachelorette and everyone wanted to know where I got it!! the navy is so much chicer than basic black 💙",
      "date": "2 weeks ago",
      "img": 4
    },
    {
      "name": "Charlotte P.",
      "platform": "tiktok",
      "rating": 5,
      "text": "the gold rhinestone pattern is EVERYTHING. bodycon dresses usually don't fit me right but this one is perfection. size up if between sizes!",
      "date": "2 weeks ago",
      "img": 5
    },
    {
      "name": "Amelia W.",
      "platform": "google",
      "rating": 5,
      "text": "Best party dress I've ever bought. The square neckline is so flattering and the spaghetti straps are adjustable. Navy blue is gorgeous in person.",
      "date": "3 weeks ago",
      "img": 6
    },
    {
      "name": "Harper D.",
      "platform": "instagram",
      "rating": 5,
      "text": "literally felt like a celebrity in this dress. the gold crystals sparkle under club lights and the navy is such a vibe. worth every penny!! 💎",
      "date": "3 weeks ago",
      "img": 7
    },
    {
      "name": "Evelyn R.",
      "platform": "tiktok",
      "rating": 5,
      "text": "wore this to Vegas and it was PERFECT. the thigh-high slit is sexy but not too much. rhinestones stayed on all night dancing!!",
      "date": "1 month ago",
      "img": 8
    },
    {
      "name": "Abigail S.",
      "platform": "facebook",
      "rating": 5,
      "text": "I was worried about the quality for the price but this dress is SOLID. The rhinestones are well-attached and the fabric is thick enough to be flattering.",
      "date": "1 month ago",
      "img": 9
    },
    {
      "name": "Emily C.",
      "platform": "tiktok",
      "rating": 5,
      "text": "this dress is my new go-to for everything!! wore it to a wedding, then a club, then my anniversary dinner. the navy with gold is so versatile ✨",
      "date": "1 month ago",
      "img": 10
    },
    {
      "name": "Elizabeth H.",
      "platform": "instagram",
      "rating": 5,
      "text": "okay but the way this dress makes my body look?? 🔥 the bodycon fit is so flattering and the gold accents add just enough sparkle. 10/10",
      "date": "1 month ago",
      "img": 11
    },
    {
      "name": "Mila J.",
      "platform": "trustpilot",
      "rating": 5,
      "text": "Designer dress vibes for a fraction of the price. The navy blue is deep and rich, the gold rhinestones are placed perfectly in a starburst pattern. Absolutely stunning quality.",
      "date": "2 months ago",
      "img": 12
    },
    {
      "name": "Ella B.",
      "platform": "tiktok",
      "rating": 5,
      "text": "if you're hesitating just BUY IT. true to size, the slit is perfect, and everyone will ask you about it. navy + gold combo is unmatched 💙✨",
      "date": "2 months ago",
      "img": 13
    },
    {
      "name": "Avery N.",
      "platform": "instagram",
      "rating": 5,
      "text": "the square neckline on this dress is everything. so flattering and the spaghetti straps are adjustable. navy blue looks amazing with my skin tone!!",
      "date": "2 months ago",
      "img": 14
    },
    {
      "name": "Scarlett V.",
      "platform": "google",
      "rating": 5,
      "text": "This dress exceeded all my expectations. The gold rhinestone embellishments are secure and the navy color is vibrant. Fits like a glove and looks expensive.",
      "date": "2 months ago",
      "img": 15
    },
    {
      "name": "Madison F.",
      "platform": "facebook",
      "rating": 5,
      "text": "I bought this for NYE and got SO many compliments. The rhinestones catch every light and the bodycon fit is stretchy but supportive. Love it!",
      "date": "3 months ago",
      "img": 16
    },
    {
      "name": "Layla K.",
      "platform": "tiktok",
      "rating": 5,
      "text": "this is THE party dress. navy is way more interesting than black and the gold rhinestones are chef's kiss. already planning what event to wear it to next!!",
      "date": "3 months ago",
      "img": 17
    },
    {
      "name": "Chloe A.",
      "platform": "instagram",
      "rating": 5,
      "text": "the attention to detail on this dress!! the gold crystal pattern, the perfect slit length, the flattering neckline. it's giving expensive and I'm obsessed 💎",
      "date": "3 months ago",
      "img": 18
    },
    {
      "name": "Zoey L.",
      "platform": "tiktok",
      "rating": 5,
      "text": "RAN to leave this review. this dress is STUNNING in person. the navy blue is so rich and the gold rhinestones sparkle like crazy. felt like the hottest person in the room 🔥",
      "date": "3 months ago",
      "img": 19
    }
  ],
  "featured_reviews": [
    {
      "name": "Olivia R.",
      "platform": "instagram",
      "platformColor": "#E4405F",
      "rating": 5,
      "text": "This dress is everything! The navy blue is so much more unique than black and the gold rhinestone pattern is absolutely gorgeous. I wore it to a club for NYE and literally every person asked where I got it. The bodycon fit is so flattering and the square neckline with the spaghetti straps is chef's kiss. The thigh-high slit is the perfect length - sexy but classy. Already planning my next event to wear it again!",
      "helpful": 127,
      "verified": true
    },
    {
      "name": "Grace M.",
      "platform": "tiktok",
      "platformColor": "#000000",
      "rating": 5,
      "text": "I've bought a lot of party dresses but this one is different. The quality is insane - the rhinestones are all securely attached and the fabric has amazing stretch without being see-through. The navy color is so rich and the gold accents catch the light perfectly. I'm 5'6 and got a medium and it fits like it was made for me. The bodycon style hugs everything right and the slit makes it easy to walk and dance. Worth every single penny!",
      "helpful": 94,
      "verified": true
    },
    {
      "name": "Victoria S.",
      "platform": "facebook",
      "platformColor": "#1877F2",
      "rating": 5,
      "text": "Wore this to my friend's bachelorette party in Miami and I've never gotten so many compliments on a dress in my life. The navy blue with gold rhinestones is such a stunning combination. The fit is true to size and incredibly flattering - the bodycon style smooths everything out. The square neckline is perfect and the adjustable straps mean you can customize the fit. This dress looks like it should cost $300+ but it's so affordable. Already recommended it to all my friends!",
      "helpful": 81,
      "verified": true
    },
    {
      "name": "Luna H.",
      "platform": "instagram",
      "platformColor": "#E4405F",
      "rating": 5,
      "text": "This dress has become my signature piece! I've worn it to three different events and each time people are shocked when I tell them the price. The gold rhinestone starburst pattern is so unique and eye-catching. The navy blue is such a sophisticated alternative to black. The bodycon fit is stretchy and comfortable even after hours of wear. The slit is positioned perfectly and the overall quality is exceptional. This is one of those rare purchases where you feel like you got way more than you paid for!",
      "helpful": 103,
      "verified": true
    },
    {
      "name": "Aria C.",
      "platform": "google",
      "platformColor": "#4285F4",
      "rating": 5,
      "text": "I'm super picky about party dresses and this one exceeded all expectations. The navy color is deep and luxurious, the gold rhinestones are placed in such a beautiful pattern. The fabric quality is excellent - thick enough to smooth everything but stretchy enough to be comfortable. The square neckline is incredibly flattering and the spaghetti straps stay in place. I wore this to a rooftop party and felt like a million dollars. The compliments were nonstop. If you're on the fence, just get it - you won't regret it!",
      "helpful": 72,
      "verified": true
    }
  ]
}
